[
    {
        "date":1643155200000,
        "title":"Foreign nationals in China well protected from COVID-19: FM spokesperson",
        "body":"BEIJING - Foreign nationals in China have been well protected by the country's effective epidemic prevention and control measures, a Chinese foreign ministry spokesperson said Wednesday, urging the United States to think carefully about the so-called 'authorized departure' of its diplomats. According to media reports, the US Embassy in China is waiting for government approval to evacuate diplomats and dependents because of the implementation of strict pandemic regulations in the country. In response, spokesperson Zhao Lijian said at a news briefing that China's epidemic prevention and control protocols are rigorous and science-based, and are in line with provisions in the Vienna Convention on Diplomatic Relations and the Vienna Convention on Consular Relations. \"Our effective measures have well protected foreign nationals in China,\" Zhao said. \"We have made diplomatic and consular staff in China feel comfortable and protected their legitimate rights and interests.\" Noting that China is undoubtedly the safest country at present, Zhao said evacuating from the safest place in the world will only expose US personnel to much greater risks of infection. \"The logic behind the US decision is confusing and hardly justifiable.\" China has expressed grave concern and dissatisfaction over this to the US side, according to Zhao. \"We hope the United States can observe China's COVID-19 protocols, take China's position and concerns seriously, and think carefully about the so-called 'authorized departure' of diplomatic and consular staff,\" he added. Copyright 1995 -  . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form."
    },
    {
        "date":1643155200000,
        "title":"China vital to global food security: US media",
        "body":"NEW YORK - China plays an important role in global food security, US World Grain magazine has reported. All countries have vowed to make domestic food security a top priority, but no country has been more committed to this goal in recent years than China, the report said. Already a major producer of corn and wheat and the perennial leader in soybean imports, China over the years has continued to increase the imports of those commodities, which gives it a comfortable surplus to feed its 1.4 billion people, it noted. Copyright 1995 -  . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form."
    },
    {
        "date":1643155200000,
        "title":"Study: China matters to American heartland",
        "body":"A study by the United States Heartland China Association (USHCA) has shown \"genuine connection, deep friendship and tangible benefits throughout the heartland region\" from its relationship with China, according to Min Fan, the association's executive director. The data from Why China Matters to the Heartland included foreign direct investment (FDI) from China, along with trade volume and educational and cultural exchange activities between more than 20 American heartland states and China. Numerous state and business leaders presented their perspectives Tuesday during an online discussion of the study. For example, Arkansas enjoys robust trade with China, with more than $1 billion in exports sent there in 2020, the most recent data available, said Denise Thomas, CEO of the World Trade Center of Arkansas. The China market helped to create more than 5,000 jobs for Arkansas. Four recent FDI projects from China are expected to total more than $1.4 billion, and Chinese students account for more than 10 percent of all international students in the state. Amy Lei, senior manager of Asia business development at JobsOhio, said more than 50 Chinese companies employ over 7,000 workers in her state. Fuyao Glass America is Ohio's largest Chinese company, employing more than 2,000 workers. Ohio's export business to China supports more than 13,000 jobs, and $3.4 billion in goods were exported to China in 2020, Lei said. In higher education, 14,000 Chinese students are studying in the state, accounting for 41 percent of its international student body. Fanfu Li, international business development director at the Wisconsin Economic Development Corp, discussed the state's ties with China: It imported $5.5 billion of goods from China in 2020, and its export of goods to China reached $1.6 billion in 2020, supporting 12,200 jobs as a result. Nearly 43 percent of Wisconsin's international students are from China. China is the main importer of North Dakota's agricultural products. The state's exports to China grew 90 percent from 2011 to 2020, four times the growth of its exports to other parts of the world. Craig Allen, president of the US-China Business Council, said China remains the third-largest overseas market for the US after Canada and Mexico. In 2020, the US exported $123 billion of goods to China. While the number for 2021 is not complete, Allen estimated that it will reach $135 billion. Exports to China from the heartland region have experienced great growth due to the resumption of agricultural exports to China, after those shipments had nosedived due to the trade conflict, Allen noted. Exports from Kansas to China more than doubled to $1.9 billion in 2020 and are expected to grow another 30 percent in 2021. For the first 11 months of 2021, US agricultural exports to China grew by 35 percent, Allen said. He expects many of the heartland states to experience similar growth for 2022. Bob Holden, chairman of the USHCA, opened Missouri's first China office in Beijing when he was the governor and actively promoted relations with China as a professor. He recalled that the heartland region saw China as the greatest opportunity and was the first in line to benefit from that global connection. \"Fast forward to today, I am sad to see China has become a liability in many circles,\" Holden said. Organizations like his are even attacked as pro-China or accused of working for the Chinese government. Those kinds of accusations are unfounded, he said. \"To be clear, USHCA believes in the importance of engaging with China,\" he said, echoing other leaders' wishes for a more amicable relationship between the largest two economies in the world. \"It's my belief that the United States and China's partnership and collaboration (are) absolutely critical if our planet wants to successfully address the most significant global challenges of our times,\" Holden said. Copyright 1995 -  . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form."
    },
    {
        "date":1643155200000,
        "title":"Rising freestyle skier looks forward to Beijing Games",
        "body":"With the Beijing Winter Olympics just around the corner, teenager Eileen Gu, a Chinese freestyle skier who has recorded a fourth-straight win of the FIS World Cup this season, is drawing attention from fans around the globe. Copyright 1995 -  . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form."
    },
    {
        "date":1643155200000,
        "title":"Chinese embassy in the US to host an online reception for the 2022 Chinese New Year of the Tiger",
        "body":"A Reception for the 2022 Chinese New Year of the Tiger, which is themed \"A Vigorous Year of the Tiger, A Joyful Rendezvous for Winter Olympics\" will be held online by the Chinese embassy in the US on January 30 at 8 pm EST. At the reception, Chinese Ambassador Qin Gang and invited guests from the US will deliver video remarks. Performances, including Chinese lantern exhibition and Spring Festival Cultural Week, Panda Reunion, \"Winter Olympic Imagination — Joy on Ice & Snow\" will be on show. Your participation is welcome! Time 8pm Eastern Time, January 30, 2022 9am Beijing Time, January 31, 2022 Watch the reception at: @ChineseEmbinUS  Youtube Facebook @NewChinaTV @CGTN @ChinaDaily Also from Jan 26 through Jan 29 for four consecutive days, on the Embassy's Youtube and Facebook channel will be shown Documentary \"New Endeavors\", Chinese and American Youth Spring Festival Gala, Spring Festival & Winter Olympics Celebration by Overseas Chinese in the US, and \"My China Album\" video highlight. Stay tuned! Copyright 1995 -  . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form."
    }
]