[
    {
        "date":1636934400000,
        "title":"Video: A dialogue with the Flying Tigers",
        "body":"China Daily's Edgar Snow Newsroom is a new project exploring China's story in greater detail. Eighty years ago, the Flying Tigers came to China's aid to help them defeat invading Japanese forces during World War II. China Daily reporter Ian Goodrum spoke to people working to keep the Flying Tigers' legacy alive, and a veteran who lived it. Check out this exclusive video to learn more. Copyright 1995 -  . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form."
    },
    {
        "date":1636934400000,
        "title":"US business groups urges reducing tariffs on Chinese goods amid rising inflation pressures",
        "body":"WASHINGTON -- About two dozen US business associations have urged the Biden administration to reduce tariffs on Chinese goods to provide relief to Americans amid rising inflation pressures. \"Tariffs put in place over the last several years continue to disproportionately cause economic harm to US businesses, farmers, workers and families,\" the business associations, led by the US-China Business Council, said Friday in a letter to US Trade Representative Katherine Tai and Treasury Secretary Janet Yellen. American importers have paid over 110 billion US dollars for the so-called \"Section 301\" tariffs on Chinese goods, of which about 40 billion dollars has been assessed during the Biden Administration, according to the letter. \"These costs, compounded by other inflationary pressures, impose a significant burden on American businesses, farmers and families trying to recover from the effects of the pandemic,\" the letter said. \"We agree with Secretary Yellen's recent comments that tariffs tend to increase domestic prices and raise costs to consumers and businesses due to higher cost inputs and that lowering US and Chinese tariffs could help ease inflation,\" the letter said, urging the Biden administration to work toward removal of the Section 301 tariffs on Chinese goods. \"We also request immediate action to significantly broaden the tariff exclusion process to provide additional relief to Americans,\" the letter said. The other 24 business associations that signed the letter include the US Chamber of Commerce, the Business Roundtable, the National Retail Federation, American Farm Bureau Federation and the Semiconductor Industry Association. Americans for Free Trade, a coalition of more than 150 industry associations that are united in the fight against tariffs, has also recently urged the Biden administration to remove tariffs on imports from China amid continued concerns over inflation. \"As our nation continues to face concerns over rising prices and supply chain obstacles, it is time for Ambassador Tai and other members of the Biden administration to recognize that leaving the previous administration's failed trade policies in place will only make the problem worse,\" Americans for Free Trade spokesperson Jonathan Gold said in a statement earlier this month. \"For the sake of Americans everywhere, it is time to bring the trade war with China to an end,\" Gold said. Copyright 1995 -  . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form."
    },
    {
        "date":1636934400000,
        "title":"Trade with Beijing a boon to employment in US state",
        "body":"The US state of Oregon is experiencing record exports and growing imports from China despite tensions between the United States and China. China is Oregon's largest trading partner, and the state is China's fourth-largest source for imports. Last year, Oregon's exports to China were worth about $9.5 billion, an increase of 32 percent on 2019, the Oregon governor's office said. The state's first congressional district, which covers part of the city of Portland, exported $7.5 billion worth of goods to China last year, more than any of the other 434 congressional districts that elect members to the US House of Representatives, said the 2021 District Export Report, published by the US-China Business Council recently. In the district is an area known as Silicon Forest, which is home to high-tech manufacturers. Its exports to China have more than doubled over the past 10 years. The rapid growth, driven mostly by booming exports of semiconductors, helps the district's exports support more than 24,500 jobs, about 9,000 more than in 2018, the report said. \"Our relationship with China allows us to expand Oregon's business and trade partnerships, promote our booming agricultural market and support jobs for Oregonians,\" Charles Boyle, a spokesman for Governor Kate Brown, said. More than 1,000 businesses in the state, particularly in the computing, agriculture and food products industries, do business with China, Boyle said. While China is the top foreign market for Oregon's grass seed-about $45 million in seed went to China last year-trade with China is dominated by semiconductors produced in the state and shipped to China, where they are assembled into electronic products, Boyle said. Semiconductors and their components make up the second-largest category of US goods exported to China, and more than half come from Oregon's first congressional district. \"The Port of Portland enjoys a strong trade connection with China, with goods flowing in both directions,\" said Keith Leavitt, chief of the Port of Portland's Trade and Equitable Development Division. \"On the export side, some of our top products include integrated circuits, electronic instruments and footwear parts that travel through our airport, while vehicles, fertilizer, grains and soybeans make their way to China through our seaport. 'Important market' \"China is an important market, and our businesses value the two-way trade that the Port of Portland's air and marine connections provide.\" On average, US exports to China have grown 2.4 percent a year over the past 10 years, which is faster than the rest of the top goods markets in the US. Last year, US exports to China rose 18 percent, while exports to the rest of the world fell 15 percent, the US-China Business Council report said. \"This disparity is likely the result of China outpacing the rest of the world in its recovery from the pandemic-induced slowdown,\" the report said. It also attributed the growth to Chinese tariff exclusions in support of Phase One trade commitments, which \"encouraged a more normal flow of goods from the US despite both countries maintaining heightened tariffs on each other's goods\". Despite the uncertainty around the removal of tariffs by both sides, Boyle said Governor Brown believes that increasing business, cultural, and educational connections between Oregon and China will help promote trade. Copyright 1995 -  . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form."
    },
    {
        "date":1636934400000,
        "title":"Talk seen as chance to put ties back on track",
        "body":"Tuesday's virtual meeting important for US, China, 'but also international relations' The plan for a virtual meeting between President Xi Jinping and United States President Joe Biden is the outgrowth of the two countries' latest efforts to steer bilateral ties back toward dialogue and cooperation in the face of risks and challenges that they must be jointly addressed, analysts said. It also reflects that Washington sees it has achieved nothing with its Cold War mentality-guided suppression of China, they added. Ahead of the meeting to be held on Tuesday, State Councilor and Foreign Minister Wang Yi and US Secretary of State Antony Blinken affirmed in a phone conversation on Saturday the significance of the planned meeting, news of which is being keenly followed by the world. Wang referred to the meeting as \"an important event, not only for China-US relations, but also for international relations\", and he said that the two peoples and the international community are expecting outcomes beneficial to both countries and to the world coming from it. Wang said the two leaders' helmsmanship plays a pivotal role in piloting bilateral ties, and he urged the US to work in the same direction with China and bring China-US relations back onto the track of sound and steady development. Wang also elaborated on China's solemn position in response to Washington's recent wrongdoings on the Taiwan question, saying that the US should abide by the commitments it made in the three China-US joint communiques, put its one-China policy into action and stop sending the wrong signals to \"Taiwan independence\" forces. Ma Xiaolin, a professor at Zhejiang International Studies University, said the agreement for a virtual meeting showed the importance the two heads of state attach to their bilateral ties and their willingness to manage risks and differences so as to return the China-US relationship to the direction of positive development. \"As the two are the world's largest developed and largest developing country, it is necessary for both sides to make concerted efforts in the fight against the COVID-19 pandemic, and toward promoting global economic recovery and rebuilding their strategic mutual trust,\" Ma said. The meeting will be the first one-on-one meeting of Xi and Biden via video link since the US president took office in January. Previously, they had two phone conversations, one in February and the other in September. Guided by the spirit and content of the leaders' telephone conversations, senior Chinese and US officials have had several face-to-face interactions this year in Anchorage, Tianjin, Zurich and Rome. Last week, at the 26th session of the Conference of the Parties to the United Nations Framework Convention on Climate Change in Glasgow, the two countries' climate envoys announced a China-US declaration vowing to boost climate cooperation in the next decade. Li Haidong, a professor of US studies at China Foreign Affairs University, said that bilateral cooperation between China and the US shows great potential and is urgently needed by both countries and the world. As Xi pointed out in his phone call with Biden in September, whether China and the US can handle their relationship well has a bearing on the future of the world and it is the question of the century, to which the two countries must provide a good answer. Li said that most disputes between China and the US were due to Washington's disrespect for China's sovereignty, security and development interests and its interference in China's internal affairs on issues concerning Xinjiang, Hong Kong and Taiwan. \"Cooperation will be difficult if the US keeps stirring up trouble on these issues and does not stop infringing China's rights and interests,\" Li said. Ruan Zongze, executive vice-president of the China Institute of International Studies, said that the US has for some time adopted a wrong China policy due to its misjudgment on bilateral ties and thus, out of its Cold War mentality, has undertaken a series of acts that crack down on China. \"But Beijing has calmly stood against Washington's suppression and taken resolute measures in response. So the US has had to rethink and adjust its China policy and engage with China now through dialogue and communication,\" Ruan said. It is not possible that things will suddenly turn around after this meeting, Ruan said, but it can be expected that with mutual understanding and communication being enhanced this time, conditions for the next step in the development and adjustment of China-US relations will be created. Copyright 1995 -  . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form."
    }
]