[{"date": ["2022-05-03"], "article_link": ["https://www.chinadaily.com.cn/a/202205/03/WS62706fd0a310fd2b29e5a6da.html"], "title": ["Exchanges give Sino-US ties a sporting chance"], "author": ["\n            By LIU YINMENG in Los Angeles | \n            CHINA DAILY |\n            Updated: 2022-05-03 07:56\n          "], "location": ["\n            By LIU YINMENG in Los Angeles | \n            CHINA DAILY |\n            Updated: 2022-05-03 07:56\n          "], "body": ["<p>Exciting developments are happening in sports exchanges between China and the United States, an area in which the two sides have \"tremendous opportunities\" for future collaboration.</p>", "<p>Such was the sentiment shared by participants in a virtual conference on April 27 that celebrated decades of sister-city bonds between the two nations.</p>", "<p>Utah has a great legacy for sports and the Olympic Games, said Jeff Robbins, president and chief executive of the Utah Sports Commission, which aims to enhance the state's economy through the attraction, promotion and development of sports.</p>", "<p>The state has organized 1,000 athletic events since the 2002 Winter Olympic and Paralympic games were held in Salt Lake City, Robbins said. It is also the US' choice as a candidate to host the 2030 Winter Games.</p>", "<p>\"Thirty percent of all athletes that participated in the Olympic and Paralympic games in Beijing either lived or trained in Utah,\" he said. The state had 80 participants in the 2022 Beijing Winter Olympics, and they greatly appreciated the hospitality of the Chinese people, \"who welcomed them warmly in a very difficult time\", he said.</p>", "<p>To prepare the athletes for those competitions, the University of Utah made use of a cooperative training program with China. It has brought about 300 Chinese coaches to the US to learn about coaching techniques, injury prevention, treatment, nutrition and other experiences that \"can be exchanged globally with our friends in China\", Robbins said.</p>", "<p>Motorsports is one of those collaborative areas. Chinese carmaker Geely Auto Group, which owns Volvo and Polestar, purchased the Utah Motorsports Campus, a 206-hectare racetrack in Tooele County, in 2018.</p>", "<p>That facility will have exchanges with China to train people in the US, to share ideas about how to host major sporting events in the motorsports space and to show how to operate a major track in Utah and how to manage tracks in China, Robbins said.</p>", "<p>\"We are excited for the future. We are excited to continue to partner with our friends from China. We think we have tremendous opportunities,\" he said.</p>", "<p>Beijing Vice-Mayor Zhang Jiandong also acknowledged the immense potential for sports collaboration between China and the US.</p>", "<p>\"Both China and the US are major countries in sports. Sports exchanges are an integral part of the people-to-people and cultural exchanges between the two nations,\" he said.</p>", "<p>In recent years, Beijing has worked with New York City, the California city of Irvine, and other US cities and states on exchanges involving ice hockey, coach training and other areas, said Zhang, adding that this cooperation has enhanced the friendship between Beijing residents and people from across the US.</p>", "<p><strong>'Go down in history'</strong></p>", "<p>Just months ago, the Beijing Winter Olympics and Paralympics came to a successful completion. After seven years of hard work, the Chinese people and those from all over the world overcame difficulties to once again create an Olympic event that will \"go down in history\", he said. Zhang also extended his best wishes to US cities like Los Angeles that will host or bid for the Olympics.</p>", "<p>\"Let us work together to promote the high-quality development of global sports,\" he said.</p>", "<p>Wang Liyong, mayor of Zhengding county in Hebei province, introduced Zhengding's national table tennis training base to the conference's participants. It is a training ground for China's team.</p>", "<p>Many Chinese Olympic champions, including Deng Yaping and Liu Guoliang, have honed their skills at the center, Wang said.</p>", "<p>The base integrates functions such as training, competition, teaching, research, exhibitions and international exchanges. It has hosted a variety of events including the international youth training camp. Every year, table tennis teams from across the world go to the center to drill, he said.</p>", "<p>Zhengding established sister-city relations with Muscatine, Iowa, in 2013. Those ties have led to frequent visits between both sides, the deepening of friendships and enhanced cooperation in sports and other fields, with table tennis as a catalyst, Wang said.</p>", "<p>Chinese President Xi Jinping visited Muscatine to study US agriculture in 1985, when he was party secretary of Zhengding. To mark the 30th anniversary of Xi's visit, the county gifted Muscatine a ping-pong table and other accessories in 2015, to encourage residents to participate in table tennis, Wang said.</p>", "<p>\"We in Muscatine are looking forward to continuing our relations, and we are looking forward to starting people-to-people exchanges between our cities,\" said Muscatine Sister Cities President John Dabeet.</p>"]}]